snlkuharlocal/src/Documents/ЗатратыМерчендайзинга/ЗатратыМерчендайзинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗатратыМерчендайзинга</name>
  <registerRecords>AccumulationRegister.ЗатратыМерчендайзинга</registerRecords>
  <attributes>
    <name>ПериодЗатрат</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>ФактическийАдрес</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>КолSKU</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНаВизит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолПосещенийМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолРаботоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЧаса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ЗатратыМерчендайзинга/ЗатратыМерчендайзинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыМерчендайзинга</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КолSKU</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНаВизит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолПосещенийМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолРаботоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГодовойБюджет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контаргент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/ЗатратыМерчендайзинга/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	
	Для каждого ТекСтрока из Список Цикл 
	    		
		Движение = Движения.ЗатратыМерчендайзинга.Добавить();
		Движение.Период	= НачалоМесяца(ПериодЗатрат);
		движение.Контаргент = контрагент;
			
		Движение.ВремяНаВизит = текстрока.времяНавизит;
		движение.КолSKU = текСтрока.КолSKU;
		движение.КолПосещенийМесяц = текСтрока.КолПосещенийМесяц;
		движение.КолРаботоЧасов = текСтрока.КолРаботоЧасов;
		Движение.Подразделение = текстрока.ФактическийАдрес.ДепартаментЗаКемЗакреплен;
		движение.ПунктДоставки = ТекСтрока.ФактическийАдрес;
		движение.СтавкаЧаса = ТекСтрока.СтавкаЧаса;
		Движение.Регистратор = ссылка;
		движение.ГодовойБюджет = текСтрока.КолРаботоЧасов*12*ТекСтрока.СтавкаЧаса;		
		
	КонецЦикла;
	
	
КонецПроцедуры
